In [10]:
import pandas as pd

In [94]:
import numpy as np

In [18]:
data = {
    "c1": [1, 2, "누락"],
    "c2": [1.11, "", 3.33],
    "c3": ["one", "two", "three"],
}
columns = ["c1", "c2", "c3"]
index = [_ for _ in range(3)]
df = pd.DataFrame(data, index=index, columns=columns)

df

   c1    c2     c3
0   1  1.11    one
1   2          two
2  누락  3.33  three

>데이터를 csv파일로 출력할 땐 to_csv()메서드를 활용합니다. 첫 인자로는 파일 경로를 입력한다.  
 인덱스를 제거하고 저장

In [27]:
df.to_csv("sample1.csv", index=False)

>만든 csv파일로부터 데이터를 불러오는 작업을 할 땐 read_csv()메서드를 활용합니다.

In [29]:
df_read = pd.read_csv("sample1.csv")
df_read

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

>이번에는 column 인덱스를 배제하고 저장 header=False

In [31]:
df.to_csv("sample2.csv", index=False, header=False)

>column 인덱스 정보가 없는 경우에는 read_csv()의 names 키워드 인수를 활용해서 설정할 수 있다.

In [35]:
pd.read_csv("sample2.csv", names=["c1", "c2", "c3"])

   c1    c2     c3
0   1  1.11    one
1   2   NaN    two
2  누락  3.33  three

>콤마가 없고 공백으로 구분한 경우

In [36]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing sample3.txt

>공백이 구분자인 경우에는 "\s+" 정규식문자열을 사용하면 됩니다.

In [40]:
pd.read_table("sample3.txt", sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [41]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [51]:
pd.read_csv("sample4.txt", skiprows=(0,1))

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [65]:
df_na_val = pd.read_csv("sample1.csv", na_values=["누락"])
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

In [67]:
df_na_val.to_csv("sample5.txt", sep="|")
df_na_val

    c1    c2     c3
0  1.0  1.11    one
1  2.0   NaN    two
2  NaN  3.33  three

>NaN을 누락으로 변경

In [70]:
df_na_val.to_csv("sample6.csv", na_rep="누락")

>웹상의 데이터는 (주소)를 넣으면 된다.

In [73]:
titanic = pd.read_csv("https://storage.googleapis.com/tf-datasets/titanic/train.csv")

In [74]:
titanic

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y
...,...,...,...,...,...,...,...,...,...,...
622,0,male,28.0,0,0,10.5000,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.0500,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.0000,First,B,Southampton,y
625,0,female,28.0,1,2,23.4500,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.7500,Third,unknown,Queenstown,y

> 앞부분 부터는 head() 뒷부분 부터는 tail() 메서드를 써서 짤라서 볼 수 있다.

In [78]:
titanic.head(5)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y

In [77]:
titanic.tail(5)

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
622,0,male,28.0,0,0,10.50,Second,unknown,Southampton,y
623,0,male,25.0,0,0,7.05,Third,unknown,Southampton,y
624,1,female,19.0,0,0,30.00,First,B,Southampton,y
625,0,female,28.0,1,2,23.45,Third,unknown,Southampton,n
626,0,male,32.0,0,0,7.75,Third,unknown,Queenstown,y

>## DataFrame 고급 인덱싱
 Pandas는 Numpy 배열과 같이 콤마(,)를 사용한 (row인덱스, column인덱스)형식의 2차원 인덱싱을 지원하기 
 위해 다음과 같은 특별한 인덱서 속성을 제공한다.
 
>- loc: label 값 기반의 2차원 인덱싱
>- iloc: 순서를 나타내는 정수 기반의 2차원 인덱싱

>df.loc[row 인덱싱값]  / column 인덱싱 값생략  
 df.loc[row 인덱싱값, column 인덱싱 값]

In [98]:
x = np.arange(10,22).reshape(3,4)
x

array([[10, 11, 12, 13],
       [14, 15, 16, 17],
       [18, 19, 20, 21]])

In [99]:
x = np.arange(10,22).reshape(3, 4)
columns = ["A", "B", "C", "D"]
index = ["a", "b", "c"]
df = pd.DataFrame(x, index=index, columns=columns)

df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

>만약 loc인덱서를 사용하면서 인덱스를 콤마 없이 **하나만** 넣으면 row를 선택합니다.  
 인덱스 데이터가 "a"인 행을 고르면 해당하는 row가 Series로 반환됩니다.

In [100]:
df.loc["a"]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [102]:
df.loc["b":"c"] #loc를 쓰나 안쓰나 똑같이 나옴

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [105]:
df.loc[["b","c"]]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [107]:
df.A > 15 # 영문자 column에 대해서만 이런식으로 쓸 수 있다.

a    False
b    False
c     True
Name: A, dtype: bool

In [110]:
df.loc[df.A > 15] # df.loc[] [소괄호]안에 True인 값만 출력해서 보여준다.

    A   B   C   D
c  18  19  20  21

In [115]:
def select_rows(df, num):
    return df.A > num

In [116]:
select_rows(df, 10)

a    False
b     True
c     True
Name: A, dtype: bool

In [117]:
df.loc[select_rows(df.A > num)]

NameError: name 'num' is not defined

In [119]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4,4), columns = ["A", "B", "C", "D"])
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [121]:
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [122]:
df2.iloc[1:2]

    A   B   C   D
1  14  15  16  17

In [124]:
df.loc["a","A"] #column값 뒤에 row값

10

> row부터 쓴다

In [130]:
df.loc["b":,"A"]

b    14
c    18
Name: A, dtype: int32

In [132]:
df.loc["a",:]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [133]:
df.loc[["a","b"],["B","D"]]

    B   D
a  11  13
b  15  17

In [134]:
df.loc[df.A > 10, ["C", "D"]]

    C   D
b  16  17
c  20  21

In [136]:
df.iloc[0, 1]

11

In [138]:
df.iloc[:2, 2]

a    12
b    16
Name: C, dtype: int32

In [139]:
df.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int32

In [140]:
df.iloc[2:3, 1:3]

    B   C
c  19  20

In [141]:
df.iloc[-1] = df.iloc[-1]*2
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

In [142]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

>가장 간단한 데이터 분석인 데이터의 개수를 셀 때는 count()메서드를 사용.  
 NaN값은 세지 않는다.

In [143]:
s.count()

9

In [155]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype=float)
df.iloc[2,3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [153]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [156]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [162]:
# 0~5 사이의 정수를 100회 생성
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int32

In [164]:
s2.value_counts() # 각 숫자들의 생성 횟수

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [174]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype=float)
df.iloc[2,3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [176]:
df[0].value_counts()

3.0    2
0.0    1
4.0    1
Name: 0, dtype: int64

In [185]:
s2.value_counts() # .value_counts() 인덱스 번호 순서가 아니라 카운트가 많은 것부터 나열되어있음

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [186]:
s2.value_counts().sort_index() # .sort_index()를 추가해 인덱스 번호 순서로 재정렬

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [188]:
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [187]:
s.sort_values()

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [190]:
s.sort_values(ascending=False) # 역순으로 정렬되지만 NaN은 항상 맨 아래

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [192]:
df.sort_values(by=1)

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [198]:
df.sort_values(by=[1,2])

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [200]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [204]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [215]:
titanic["sex"].value_counts().sort_values(ascending=False)

male      577
female    314
Name: sex, dtype: int64

In [216]:
titanic["age"].value_counts().sort_values(ascending=False)

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
66.00     1
0.67      1
0.42      1
34.50     1
74.00     1
Name: age, Length: 88, dtype: int64

In [217]:
titanic["class"].value_counts().sort_values(ascending=False)

Third     491
First     216
Second    184
Name: class, dtype: int64

In [219]:
titanic["alive"].value_counts().sort_values(ascending=False)

no     549
yes    342
Name: alive, dtype: int64

In [222]:
titanic.value_counts("alive")

alive
no     549
yes    342
dtype: int64

In [460]:
titanic.value_counts("age")

age
24.00    30
22.00    27
18.00    26
30.00    25
28.00    25
         ..
20.50     1
14.50     1
12.00     1
0.92      1
80.00     1
Length: 88, dtype: int64

In [384]:
df3 = pd.DataFrame(np.ones((3,4)), columns=list("가나다라"))
df3["나"] = 2.0
df3

     가    나    다    라
0  1.0  2.0  1.0  1.0
1  1.0  2.0  1.0  1.0
2  1.0  2.0  1.0  1.0

In [398]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4,3)))
df2

   0  1  2
0  5  8  9
1  5  0  0
2  1  7  6
3  9  2  4

>axis인수에는 합계로 인해 없어지는 방향축(0 = row, 1 = column) 을 지정합니다.  
 집계를 구할 때는 sum을 사용

In [399]:
df2.sum(axis=1)

0    22
1     5
2    14
3    15
dtype: int64

In [401]:
df2.mean() # mean() 메서드는 평균을 구하면 sum()메서드와 사용법이 같다

0    5.00
1    4.25
2    4.75
dtype: float64

In [514]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [532]:
round(titanic["age"].mean(), 1)

29.7

In [531]:
round(titanic.loc[titanic.sex == "female"]["age"].mean(), 1)

27.9

In [534]:
round(titanic.loc[(titanic.sex == "female") & (titanic.pclass == 1)]["age"].mean(), 1)

34.6